import detectlanguage
import deepl



detectlanguage.configuration.api_key = '194f8dc31ce4bf0b1460ece885aad7ba'
text = '''
1.
Короткий опис:
Нелогічне розміщення логотипу та занадто великий розмір
Кроки відтворення:
* перейдіть на головну сторінку сайту
* зверніть увагу на розміщення логотипу в хедері
        Очікуваний результат:
                Логотип має гармонійно вписуватись в загальну композицію хедера
        Фактичний результат:
                Логотип завеликий і не вписується в композицію 


        2.
        Короткий опис:
                Некоректне розміщення рекламного блоку 
        Кроки відтворення:
* перейдіть на головну сторінку сайту
* зверніть увагу на розміщення рекламного блоку в хедері
Очікуваний результат:
        Рекламний блок гармонійно вписується в основну частину сайту 
        Фактичний результат:
                Рекламний блок розміщено в хедері


        3.
        Короткий опис:
                Відсутнє виділення активного розділу головного меню
        Кроки відтворення:
* Перейдіть на головну сторінку сайту 
* В головному меню виберіть будь-який розділ сайту
* Зверніть увагу, що активний розділ головного ніяк не виділяється
Очікуваний результат:
При переході між сторінками сайту за допомогою головного меню має можливість відслідковувати розділ, в якому він знаходиться
        Фактичний результат:
При переході між пунктами меню не виділяється той розділ меню, на якому знаходиться користувач. Також меню сайту не відцетровано по горизонтальній вісі


        4.
        Короткий опис:
Для використання функціоналу пошуку на сайті створена тільки кнопка, при можливості створити повноцінне пошукове поле
        Кроки відтворення:
* Перейдіть на головну сторінку сайту 
* Зверніть увагу на кнопку пошуку
        Очікуваний результат:
Поле пошуку повністю відображається в хедері
Фактичний результат: 
В хедері відображається лише кнопка, при натисканні на яку відображається поле пошуку


        5.
        Короткий опис:
Кнопка перелистування стрічки візуально не відповідає тій функції яку вона виконує
        Кроки відтворення:
* Перейдіть на головну сторінку
* Проскрольте вниз до стрічки статей (2 блок після хедера) 
* Зверніть увагу на кнопку для пролистування, розміщену ліворуч
Очікуваний результат:
Кнопка знаходиться з тієї сторони, в яку відбувається пролистування і напрямок стрілки співпадає з напрямком пролистування
        Фактичний результат:
Кнопка перелистування стрічки розміщена з лівого краю блока, хоча при натисканні перелистує стрічку вправо, стрілка вказує вниз. При наведенні курсору кнопка змінює колір на фіолетовий, а після першого настикання не змінює колір кнопки на неактивний 


        6
        Короткий опис:
У третьому блоці розміщені фотографії, підписи яких написані вертикально
        Кроки відтворення:
* Перейдіть на головну сторінку
* Проскрольте вниз до стрічки статей (3 блок після хедера) 
* Зверніть увагу на розміщення підписів фотографій
Очікуваний результат:
Текст на фотографіях розміщений горизонтально та є зручним для читання 
        Фактичний результат:
Підписи фотографій розміщені вертикально, що робить їх незручними для читання 


________________


        7.
        Короткий опис:
                Сторінка дуже перевантажена контентом 
        Кроки відтворення:
* Перейдіть на головну сторінку сайту 
* Пролистайте вниз до блоків з білим фоном
* Зверніть увагу, на кількість блоків з інформацією
Очікуваний результат:
Інформація передається структуровано і забезпечується надання можливості користувачу зосередитись на чомусь конкретному
        Фактичний результат:
Інформація подається таким чином, що складно зосередитись на чомусь одному. ЇЇ розміщення є невдалим і розсіює увагу користувача


        8.
        Короткий опис:
                Футер не відповідає загальноприйнятій структурі
        Кроки відтворення:
* Перейдіть на головну сторінку
* Пролистайте вниз сайту
* Зверніть увагу на футер, його структуру та наповнення
Очікуваний результат:
Футер відповідає структурі, містить у собі контактну інформацію, карту сайту та інше
        Фактичний результат:
Футер не містить контактної інформації, його наповнення це текстові блоки з довільною інформацією


        9.
        Короткий опис:
При переході на будь який розділ сайту відображаються блоки з головного меню, а очікувана інформація під ними 
        Кроки відтворення:
* Перейдіть на головну сторінку сайту
* Натисніть на будь який розділ меню
* Зверніть увагу, що на кожній сторінці відображаються 4 блока з головної сторінки, а потрібна інформація знаходиться під ними
Очікуваний результат:
При переході на конкретний розділ користувач відразу отримує інформацію, яка стосується відповідного пункту меню
        Фактичний результат:
При натисканні на будь який з блоків на основній сторінці або при переході на розділи в головному меню для ознайомлення з певною інформацією користувача переводить на іншу сторінку, де йому доводиться скролити вниз, щоб знайти потрібну інформацію
4149 4993 4425 6035    01 28
'''
# lang = single_detection(text=text, api_key='9c4b0dc9-8236-414b-8ce6-450f06d9622c:fx')
lang = detectlanguage.simple_detect(text)
print(lang)

translator = deepl.Translator('9c4b0dc9-8236-414b-8ce6-450f06d9622c:fx')

# for language in translator.get_source_languages():
#     if str.upper(lang) in language.code:
#         print('detected')

# print("Target languages:")
# for language in translator.get_target_languages():
#     print(language)
#
# print('--------')
# for lang in detectlanguage.languages():
#     print(lang['code'] + ' ' + lang['name'])

